Documents/ЗаменаПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаменаПриборовУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПломбыПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.УстановленныеПриборыУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.ЗаменыПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказатьПломбыПриборовУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектУстановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчетаНовый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеНовое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифаПредыдущий</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифаНовый</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомерНовый</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПломбы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПломбПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПломбыНовый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПломбПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПриборыУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тарифность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТарифностьСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРегистрацииПоказаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРегистрацииПоказанийСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрядность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовойСчетчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗаменаПриборовУчета/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуУстановленныеПриборыУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПриборыУчетаВключение.ПриборУчетаНовый КАК ПриборУчета,
		|	ТаблицаПриборыУчетаВключение.ОбъектУстановки КАК ОбъектУстановки,
		|	ТаблицаПриборыУчетаВключение.Дата КАК Период,
		|	МАКСИМУМ(ИСТИНА) КАК Действует
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаВключение
		|ГДЕ
		|	ТаблицаПриборыУчетаВключение.ПриборУчетаНовый <> ЗНАЧЕНИЕ(Справочник.ПриборыУчета.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриборыУчетаВключение.ПриборУчетаНовый,
		|	ТаблицаПриборыУчетаВключение.ОбъектУстановки,
		|	ТаблицаПриборыУчетаВключение.Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета,
		|	ТаблицаПриборыУчетаОтключение.ОбъектУстановки,
		|	ТаблицаПриборыУчетаОтключение.Дата,
		|	МАКСИМУМ(ЛОЖЬ)
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаОтключение
		|ГДЕ
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.ПриборыУчета.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриборыУчетаОтключение.Дата,
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета,
		|	ТаблицаПриборыУчетаОтключение.ОбъектУстановки";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУстановленныеПриборыУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуУстановленныеПриборыУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПриборыУчетаВключение.ПриборУчетаНовый КАК ПриборУчета,
		|	ТаблицаПриборыУчетаВключение.ВидТарифаНовый КАК ВидТарифа,
		|	ТаблицаПриборыУчетаВключение.Дата КАК Период,
		|	ТаблицаПриборыУчетаВключение.ПоказаниеНовое КАК Значение,
		|	ЛОЖЬ КАК Отключен
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаВключение
		|ГДЕ
		|	ТаблицаПриборыУчетаВключение.ПриборУчетаНовый <> ЗНАЧЕНИЕ(Справочник.ПриборыУчета.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета,
		|	ТаблицаПриборыУчетаОтключение.ВидТарифаПредыдущий,
		|	ТаблицаПриборыУчетаОтключение.Дата,
		|	ТаблицаПриборыУчетаОтключение.Показание,
		|	ИСТИНА
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаОтключение
		|ГДЕ
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.ПриборыУчета.ПустаяСсылка)";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоказанияПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуУстановленныеПриборыУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуЗаменыПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаЗаменыПриборовУчета.Дата КАК Период,
		|	ТаблицаЗаменыПриборовУчета.ОбъектУстановки КАК ОбъектУстановки,
		|	ТаблицаЗаменыПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ТаблицаЗаменыПриборовУчета.Услуга КАК Услуга,
		|	ТаблицаЗаменыПриборовУчета.ВидТарифаПредыдущий КАК ВидТарифа,
		|	ТаблицаЗаменыПриборовУчета.Показание КАК Показание,
		|	ТаблицаЗаменыПриборовУчета.ПоказаниеПредыдущее КАК ПоказаниеПредыдущее
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаЗаменыПриборовУчета
		|ГДЕ
		|	ТаблицаЗаменыПриборовУчета.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.ПриборыУчета.ПустаяСсылка)";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаменыПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуЗаменыПриборовУчета()

Процедура СформироватьТаблицуПломбыПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВременнаяТаблицаПриборыУчета.ПриборУчета,
	               |	ВременнаяТаблицаПриборыУчета.Дата КАК Период,
	               |	ВременнаяТаблицаПриборыУчета.ВидПломбы,
	               |	ВременнаяТаблицаПриборыУчета.СерийныйНомер,
	               |	ЛОЖЬ КАК Действует,
	               |	ВременнаяТаблицаПриборыУчета.Организация,
	               |	ВременнаяТаблицаПриборыУчета.Здание,
	               |	ВременнаяТаблицаПриборыУчета.ОбъектУстановки КАК ЛицевойСчет
	               |ИЗ
	               |	ВременнаяТаблицаПриборыУчета КАК ВременнаяТаблицаПриборыУчета
	               |ГДЕ
	               |	ВременнаяТаблицаПриборыУчета.ВидПломбы <> &ВидПломбы
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВременнаяТаблицаПриборыУчета.ПриборУчетаНовый,
	               |	ВременнаяТаблицаПриборыУчета.Дата,
	               |	ВременнаяТаблицаПриборыУчета.ВидПломбыНовый,
	               |	ВременнаяТаблицаПриборыУчета.СерийныйНомерНовый,
	               |	ИСТИНА,
	               |	ВременнаяТаблицаПриборыУчета.Организация,
	               |	ВременнаяТаблицаПриборыУчета.Здание,
	               |	ВременнаяТаблицаПриборыУчета.ОбъектУстановки
	               |ИЗ
	               |	ВременнаяТаблицаПриборыУчета КАК ВременнаяТаблицаПриборыУчета
	               |ГДЕ
	               |	ВременнаяТаблицаПриборыУчета.ВидПломбыНовый <> &ВидПломбы";
		
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("ВидПломбы", Справочники.ВидыПломбПриборовУчета.ПустаяСсылка());

	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ПломбыПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуУстановленныеПриборыУчета()

Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗаменаПриборовУчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ЗаменаПриборовУчетаОсновная.Ссылка.Дата,
		 |	ЗаменаПриборовУчетаОсновная.ОбъектУстановки,
		 |	ЗаменаПриборовУчетаОсновная.ПриборУчета,
		 |	ЗаменаПриборовУчетаОсновная.Показание,
		 |	ЗаменаПриборовУчетаОсновная.ПриборУчетаНовый,
		 |	ЗаменаПриборовУчетаОсновная.ПоказаниеНовое,
		 |	ЗаменаПриборовУчетаОсновная.ПоказаниеПредыдущее,
		 |	ЗаменаПриборовУчетаОсновная.ПриборУчета.Услуга КАК Услуга,
		 |	ЗаменаПриборовУчетаОсновная.ВидТарифаПредыдущий,
		 |	ЗаменаПриборовУчетаОсновная.ВидТарифаНовый,
		 |	ЗаменаПриборовУчетаОсновная.Ссылка.УказатьПломбыПриборовУчета,
		 |	ЗаменаПриборовУчетаОсновная.СерийныйНомер,
		 |	ЗаменаПриборовУчетаОсновная.СерийныйНомерНовый,
		 |	ЗаменаПриборовУчетаОсновная.ВидПломбы,
		 |	ЗаменаПриборовУчетаОсновная.ВидПломбыНовый,
		 |	ЗаменаПриборовУчетаОсновная.Ссылка.Организация,
		 |	ЗаменаПриборовУчетаОсновная.Ссылка.Здание
		 |ПОМЕСТИТЬ ВременнаяТаблицаПриборыУчета
		 |ИЗ
		 |	Документ.ЗаменаПриборовУчета.Основная КАК ЗаменаПриборовУчетаОсновная
		 |ГДЕ
		 |	ЗаменаПриборовУчетаОсновная.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаменаПриборовУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуУстановленныеПриборыУчета(ДокументСсылкаЗаменаПриборовУчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаЗаменаПриборовУчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуЗаменыПриборовУчета(ДокументСсылкаЗаменаПриборовУчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуПломбыПриборовУчета(ДокументСсылкаЗаменаПриборовУчета, СтруктураДополнительныеСвойства);
КонецПроцедуры
